
/* ========================================================================== */
#include "TM1638.h"
/* ========================================================================== */

//
// Based on http://avr.nikolaew.org/modules/tm1638
//______________________________________________________________________________
//
// РљР»Р°СЃСЃ РґР»СЏ РїР»Р°С‚РєРё LED-KEY РЅР° TM1638 x8 7-РјРё СЃРµРіРјРµРЅС‚РЅС‹С…, 8 LED, 8 key
// Р”РѕР»Р¶РЅС‹ Р±С‹С‚СЊ РѕРїСЂРµРґРµР»РµРЅС‹ РґРµС„Р°Р№РЅР°РјРё :
// TM1638_STB, TM1638_CLK, TM1638_DI, TM1638_DO, TM1638_OUTPUT
// РќР°РїСЂРёРјРµСЂ:
// #define TM1638_STB PORTA_Bit0
// #define TM1638_CLK PORTA_Bit1
// #define TM1638_DO PORTA_Bit2
// #define TM1638_DI PINA_Bit2
// #define TM1638_OUTPUT DDRA_Bit2
// Р� РµС‰Рµ РґРѕР»Р¶РЅР° Р±С‹С‚СЊ РѕРїСЂРµРґРµР»РµРЅР° С‚Р°РєС‚РѕРІР°СЏ, РІ РјРµРіР°РіРµСЂС†Р°С…, 8 РњР“С† = 8
// #define MHZ 8
//
// TM1638_STB Рё TM1638_CLK РґРѕР»Р¶РЅС‹ Р±С‹С‚СЊ РЅР°СЃС‚СЂРѕРµРЅС‹ РЅР° Р’Р«Р’РћР”
// РЎС‚СЂСѓРєС‚СѓСЂР° РїР°РјСЏС‚Рё Сѓ СЌС‚РѕР№ РїР»Р°С‚С‹ СЃС‚СЂР°РЅРЅР°СЏ вЂ“ Р±Р°Р№С‚ вЂ“ РёРЅРґРёРєР°С‚РѕСЂ,
// Р±Р°Р№С‚ (С‚РѕС‡РЅРµРµ РјР».Р±РёС‚) вЂ“ СЃРІРµРєС‚РѕРґРёРѕРґ РЅР°Рґ РЅРёРј. РџРѕС‚РѕРјСѓ Р°РІС‚РѕРёРЅРєСЂРµРјРµРЅС‚РЅР°СЏ
// Р·Р°РїРёСЃСЊ РЅРµ РіРѕРґРёС‚СЃСЏ. РҐРѕС‚СЏ С‚СѓС‚ РЅРµ СЃС‚СЂСѓРєС‚СѓСЂР° РїР°РјСЏС‚Рё 1638, Р° СЃС…РµРјР° РїР»Р°С‚С‹ РІРёРЅРѕРІР°С‚Р°.
//
// ____________________РЎР�РЎРўР•РњРђ РљРћРњРђРќР” 1638______________________________________
// Address Command Set (1100.aaaa) a-dress
// Display Control Command Set (1000.PBBB) P-ower,B-right
// Data Command Set (0100.0fR0) f-ixed,R-ead
//______________________________________________________________________________
//
//Р’РѕС‚ Рё РІСЃС‘. Р’СЃС‚Р°РІР»СЏРµС‚Рµ СЌС‚Рѕ РІ С‚РµРєСЃС‚ РёР»Рё РїРѕ include, РЅРµ Р·Р°Р±С‹РІ РїСЂРµРґРІР°СЂРёС‚РµР»СЊРЅРѕ
// РѕРїСЂРµРґРµР»РёС‚СЊ РїРёРЅС‹ (СЃРј. РІ С€Р°РїРєРµ С‚РµРєСЃС‚Р°) Рё С‚Р°РєС‚РѕРІСѓСЋ С‡Р°СЃС‚РѕС‚Сѓ РњРљ . РџРѕС‚РѕРј РѕР±СЉСЏРІР»СЏРµС‚Рµ
//    LED_KEY_TM1638 display;
//РџСЂРё РёРЅРёС†РёР°Р»РёР·Р°С†РёРё РїСЂРѕРіСЂР°РјРјС‹ РІС‹Р·С‹РІРІР°РµС‚Рµ display.init() вЂ“ Рё РјРѕР¶РЅРѕ СЂР°Р±РѕС‚Р°С‚СЊ.
// РўР°Рє, С‡С‚РѕР±С‹ Р·Р°Р¶РµС‡СЊ РїРµСЂРІС‹Р№ РѕРґРёРЅРѕС‡РЅС‹Р№ СЃРІРµС‚РѕРґРёРѕРґ вЂ“ РІС‹Р·С‹РІР°РµС‚Рµ display.led_on(0).
// Р”Р°, РµС‰Рµ РЅР°РґРѕ вЂњРІРєР»СЋС‡РёС‚СЊвЂќ РІРµСЃСЊ Р±Р»РѕРє РёРЅРґРёРєР°С‚РѕСЂР° РІС‹Р·РІР°РІ display.on(СЏСЂРєРѕСЃС‚СЊ)
//______________________________________________________________________________

#if (1==__USE_TM1638__)
#define MHZ 50

/*#include "./include/DSP28x_Project.h"
#include "./include/F2802x_Examples.h"
#include "./include/F2802x_GlobalPrototypes.h"
#include "./include/cpu.h"
#include "./include/clk.h"
#include "./include/flash.h"
#include "./include/gpio.h"
#include "./include/pll.h"
#include "./include/pwm.h"
#include "./include/wdog.h"
#include "./include/pie.h"
//#include "./include/pie_init.h"
#include "./include/timer.h"
#include "./include/adc.h"
#include "./include/sci.h"*/
//#include "./F28027_SCI.h"

#include "./include/DSP28x_Project.h"
#include "./include/F2802x_Examples.h"
#include "./include/F2802x_GlobalPrototypes.h"
#include "./include/gpio.h"

/* ========================================================================== */

extern GPIO_Handle  myGpio;

#define TM1638_OUTPUT(x)  ( GPIO_setDirection(myGpio,GPIO_Number_2,x==0?GPIO_Direction_Input:GPIO_Direction_Output) ) //DDRA_Bit2
#define TM1638_STB(x)     ( x==0 ? GPIO_setLow : GPIO_setHigh(myGpio, GPIO_Number_2) ) //PORTA_Bit0
#define TM1638_CLK(x)     ( x==0 ? GPIO_setLow : GPIO_setHigh(myGpio, GPIO_Number_1) ) //PORTA_Bit1
#define TM1638_DO(x)      ( x==0 ? GPIO_setLow : GPIO_setHigh(myGpio, GPIO_Number_0) ) //PORTA_Bit2
#define TM1638_DI         ( GPIO_getData (myGpio, GPIO_Number_0) ) //PINA_Bit2

/* ========================================================================== */
void tm1638_write(char B);
char tm1638_read(void);
void tm1638_init(void);
void tm1638_clear(char fill); // РѕС‡РёСЃС‚РєР° 7-СЃРµРіРјРµРЅС‚РЅС‹С… (0) РЅСѓ РёР»Рё Р·Р°РїРѕР»РЅРµРЅРёРµ
void tm1638_off(void); // РІС‹РєР»СЋС‡РёС‚СЊ РІСЃС‘
void tm1638_on(char bright); // Р’РљР›. СЃ РѕРїСЂРµРґ. СЏСЂРєРѕСЃС‚СЊСЋ (8 РіСЂР°РґР°С†РёР№, 0=MIN)
void tm1638_prints(char * str); // Р’С‹РІРµСЃС‚Рё РЅР° 7-СЃРµРіРј. 8 Р±Р°Р№С‚ РёР· Р±СѓС„РµСЂР°, РЅРµРІР·РёСЂР°СЏ РЅР° 0
void tm1638_printx(char sym,char X); // Р’С‹РІРµСЃС‚Рё РЅР° 7-СЃРµРіРј. 1 Р±Р°Р№С‚ РІ РїРѕР·РёС†РёСЋ X
void tm1638_led_on(char num); // РІРєР»СЋС‡РёС‚СЊ-РІС‹РєР»СЋС‡РёС‚СЊ 1 СЃРІРµС‚РѕРґРёРѕРґ
void tm1638_led_off(char num);
void tm1638_leds(char mask); // РІС‹РІРѕРґ РІСЃРµС… 8-РјРё СЃРІРµС‚РѕРґРёРѕРґРѕРІ, РјР».Р±РёС‚=Р»РµРІС‹Р№
char tm1638_getkeys(void); // РІРµСЂРЅРµС‚ Р±Р°Р№С‚ СЃРѕСЃС‚РѕСЏРЅРёСЏ РєРЅРѕРїРѕРє, РјР».Р±РёС‚ = Р»РµРІС‹Р№
/* ========================================================================== */


/* ========================================================================== */
#pragma CODE_SECTION( tm1638_write,   "ramfunc" );
#pragma CODE_SECTION( tm1638_read,    "ramfunc" );
#pragma CODE_SECTION( tm1638_init,    "ramfunc" );
#pragma CODE_SECTION( tm1638_clear,   "ramfunc" );
#pragma CODE_SECTION( tm1638_off,     "ramfunc" );
#pragma CODE_SECTION( tm1638_on,      "ramfunc" );
#pragma CODE_SECTION( tm1638_prints,  "ramfunc" );
#pragma CODE_SECTION( tm1638_printx,  "ramfunc" );
#pragma CODE_SECTION( tm1638_led_on,  "ramfunc" );
#pragma CODE_SECTION( tm1638_led_off, "ramfunc" );
#pragma CODE_SECTION( tm1638_leds,    "ramfunc" );
#pragma CODE_SECTION( tm1638_getkeys, "ramfunc" );
/* ========================================================================== */


#define __delay_cycles(x)  { volatile int d; for (d=0; d<x; d++) {} }

/* ========================================================================== */
// Р’С‹РІРѕРґ Р±Р°Р№С‚Р° SPI
// STB РґРѕР»Р¶РµРЅ Р±С‹С‚СЊ СѓСЃС‚Р°РЅРѕРІР»РµРЅ Р”Рћ С‚РѕРіРѕ
/* ========================================================================== */
void tm1638_write(char B) {
	char i;

	for (i=8; i>0; i--) {
		TM1638_CLK (0);
		TM1638_DO (B & 0x01);
		TM1638_CLK (1);
		B = B >> 1;
	}
}
/* ========================================================================== */



/* ========================================================================== */
// STB РґРѕР»Р¶РµРЅ Р±С‹С‚СЊ СѓСЃС‚Р°РЅРѕРІР»РµРЅ Р”Рћ С‚РѕРіРѕ
/* ========================================================================== */
char tm1638_read(void) {
	char B=0, i;
	for (i=8; i > 0; i--) {
		B = B >> 1;
		TM1638_CLK (0);

		__delay_cycles(MHZ*1); // 1 uS

		if ( TM1638_DI ) B |= 0x80;

		TM1638_CLK (1);
	}
	return(B);
}
/* ========================================================================== */



/* ========================================================================== */
// РѕС‡РёСЃС‚РєР°-Р·Р°РїРѕР»РЅРµРЅРёРµ
// LED РЅРµ С‚СЂРѕРіР°РµРј, С‚РѕР»СЊРєРѕ 7-СЃРµРіРјРµРЅС‚РЅС‹Рµ
/* ========================================================================== */
void tm1638_clear(char fill) {
	char i;

	TM1638_OUTPUT (1);
	TM1638_STB (0);

	__delay_cycles(MHZ*1); // 1 uS
	tm1638_write(0x42); // Р·Р°РїРёСЃСЊ, РќР• Р°РІС‚Рѕ++!

	TM1638_STB (1);

	__delay_cycles(MHZ*1);

	TM1638_STB (0);

	for (i=0; i < 8; i++) {
		tm1638_write(0xC0+i+i); // address
		tm1638_write(fill);
	}
	TM1638_STB (1);
	TM1638_OUTPUT (0);
}
/* ========================================================================== */



/* ========================================================================== */
// РќР°С‡Р°Р»СЊРЅРѕРµ СЃРѕСЃС‚РѕСЏРЅРёРµ Р»РёРЅРёР№ Рё РѕС‡РёСЃС‚РєР° РёРЅРґРёРєР°С‚РѕСЂР° (РЅРѕ РЅРµ РІРєР»СЋС‡РµРЅРёРµ! СЃРј. on() )
/* ========================================================================== */
void tm1638_init(void) {
	TM1638_OUTPUT (0);
	TM1638_STB (1);
	TM1638_CLK (1);

	__delay_cycles(MHZ*1); // 1 uS
	tm1638_clear(0x00);
}
/* ========================================================================== */



/* ========================================================================== */
// Р’С‹РєР»СЋС‡РёС‚СЊ РёРЅРґРёРєР°С†РёСЋ
/* ========================================================================== */
void tm1638_off(void) {
	TM1638_OUTPUT (1);
	TM1638_STB (0);

	tm1638_write(0x80); // OFF display

	TM1638_STB (1);

	__delay_cycles(MHZ*1);

	TM1638_OUTPUT (0);
}
/* ========================================================================== */



/* ========================================================================== */
// Р’РєР»СЋС‡РёС‚СЊ РёРЅРґРёРєР°С†РёСЋ, 8 СѓСЂРѕРІРЅРµР№ СЏСЂРєРѕСЃС‚Рё
/* ========================================================================== */
void tm1638_on(char bright) {
	TM1638_OUTPUT (1);
	TM1638_STB (0);

	tm1638_write(0x88 | (bright & 0x07));

	TM1638_STB (1);

	__delay_cycles(MHZ*1);

	TM1638_OUTPUT (0);
}
/* ========================================================================== */



/* ========================================================================== */
// Р’С‹РІРѕРґ 8 -РјРё Р±Р°Р№С‚ РёР· Р±СѓС„РµСЂР°. Р”РѕР»Р¶РЅРѕ СѓР¶Рµ Р±С‹С‚СЊ РїРµСЂРµРєРѕРґРёСЂРѕРІР°РЅРѕ РІ 7-СЃРµРіРј
// РќР°РїСЂРёРјРµСЂ РїРѕ С‚Р°Р±Р»РёС†Рµ
// char decode0F[]={0x3F,0Г—06,0x5B,0x4F,0Г—66,0x6D, 0x7D,0Г—07,0x7F,0x6F,0Г—77,0x7C,0Г—39,0x5E,0Г—79,0Г—71};
/* ========================================================================== */
void tm1638_prints(char * str) {
	char i;

	TM1638_OUTPUT (1);
	TM1638_STB (0);

	__delay_cycles(MHZ*1); // 1 uS
	tm1638_write(0x44); // Р·Р°РїРёСЃСЊ, Р°РІС‚Рѕ++

	TM1638_STB (1);

	__delay_cycles(MHZ*1);

	for ( i=0; i<8; i++) {
		TM1638_STB (0);

		tm1638_write(0xC0+i+i); // address
		tm1638_write(*(str)++);

		TM1638_STB (1);
	}
	TM1638_OUTPUT (0);
}
/* ========================================================================== */



/* ========================================================================== */
// Р’С‹РІРѕРґ Р±Р°Р№С‚Р° sym РЅР° РёРЅРґРёРєР°С‚РѕСЂ X (Р±РµР· РїСЂРѕРІРµСЂРєРё РіСЂР°РЅРёС†, РѕРґРЅР°Рѕ)
// РќРµ Р·Р°Р±С‹С‚СЊ С‡С‚Рѕ 0 СЌС‚Рѕ РєРѕРґ 0x3F
/* ========================================================================== */
void tm1638_printx(char sym, char X) {
	TM1638_OUTPUT (1);
	TM1638_STB (0);

	__delay_cycles(MHZ*1); // 1 uS

	tm1638_write(0x44); // Р·Р°РїРёСЃСЊ, Р°РІС‚Рѕ++

	TM1638_STB (1);

	__delay_cycles(MHZ*1);

	TM1638_STB (0);

	tm1638_write(0xC0+X+X); // address
	tm1638_write(sym);

	TM1638_STB (1);
	TM1638_OUTPUT (0);
}
/* ========================================================================== */



/* ========================================================================== */
// Р—Р°Р¶РµС‡СЊ РѕРґРёРЅРѕС‡РЅС‹Р№ СЃРІРµС‚РѕРґРёРѕРґ СЃРІРµСЂС…Сѓ
/* ========================================================================== */
void tm1638_led_on(char num) {
	TM1638_OUTPUT (1);
	TM1638_STB (0);

	__delay_cycles(MHZ*1); // 1 uS
	tm1638_write(0x44); // fixed write

	TM1638_STB (1);

	__delay_cycles(MHZ*1);

	TM1638_STB (0);

	tm1638_write(0xC1+num+num); // address
	tm1638_write(0x01);

	TM1638_STB (1);
	TM1638_OUTPUT (0);
}
/* ========================================================================== */



/* ========================================================================== */
// РџРѕРіР°СЃРёС‚СЊ РѕРґРёРЅРѕС‡РЅС‹Р№ СЃРІРµС‚РѕРґРёРѕРґ СЃРІРµСЂС…Сѓ
/* ========================================================================== */
void tm1638_led_off(char num) {
	TM1638_OUTPUT (1);
	TM1638_STB (0);

	__delay_cycles(MHZ*1); // 1 uS
	tm1638_write(0x44); // fixed write

	TM1638_STB (1);

	__delay_cycles(MHZ*1);

	TM1638_STB (0);

	tm1638_write(0xC1+num+num); // address
	tm1638_write(0x00);

	TM1638_STB (1);
	TM1638_OUTPUT (0);
}
/* ========================================================================== */



/* ========================================================================== */
// Р’С‹РІРµСЃС‚Рё СЃСЂР°Р·Сѓ 8 РѕРґРёРЅРѕС‡РЅС‹С… РёРЅРґРёРєР°С‚РѕСЂРѕРІ
/* ========================================================================== */
void tm1638_leds(char mask) {
	char i;

	TM1638_OUTPUT (1);
	TM1638_STB (0);

	__delay_cycles(MHZ*1); // 1 uS
	tm1638_write(0x44); // fixed write

	TM1638_STB (1);

	__delay_cycles(MHZ*1);
	for (i=0; i<8; i++) {
		TM1638_STB (0);

		tm1638_write(0xC1+i+i); // address
		tm1638_write(mask & 0x01);

		TM1638_STB (1);

		mask>>=1;
	}
	TM1638_OUTPUT (0);
}
/* ========================================================================== */



/* ========================================================================== */
// Р’РµСЂРЅРµС‚ СЃРѕСЃС‚РѕСЏРЅРёРµ РєРЅРѕРїРѕРє (РЅР°Р¶Р°С‚Рѕ = 1)
/* ========================================================================== */
char tm1638_getkeys(void) {
	char result = 0;
	char T;

	TM1638_OUTPUT (1);
	TM1638_STB (0);

	__delay_cycles(MHZ*8);

	tm1638_write(0x42); // С‡С‚РµРЅРёРµ, Р°РІС‚Рѕ++

	TM1638_OUTPUT (0);
	TM1638_DO (1); // РїРѕРґРїРѕСЂРєР° Рћ.Рљ.

	__delay_cycles(MHZ*10);

	T = tm1638_read(); //
	if (T & 0x01) result |= 0x01;
	if (T & 0x10) result |= 0x10;

	T = tm1638_read(); //
	if (T & 0x01) result |= 0x02;
	if (T & 0x10) result |= 0x20;

	T = tm1638_read(); //
	if (T & 0x01) result |= 0x04;
	if (T & 0x10) result |= 0x40;

	T = tm1638_read(); //
	if (T & 0x01) result |= 0x08;
	if (T & 0x10) result |= 0x80;

	TM1638_STB (1);

	return(result);
}
/* ========================================================================== */

#endif // __USE_TM1638__

